<template>
  <div id="app">
  	<router-view/>
  	<div class="zr_index">
	  	<div class="zr_bottom">
	  		<ul>
	  			<li>
	  				<router-link to='/index/community' active-class='color_green'>
		  				<div class="svg_word">
		  					<div class="svg">
		  						<svg viewBox="0 0 1024 1024" width="200" height="200">
										<path d="M704 720.544c-14.688 0-27.104 9.92-30.848 23.36h-232.448c-23.904 0-49.152 14.048-62.4 34.016l-34.4 32.64-0.064-12.576a32.48 32.48 0 0 0-3.68-14.752c-12.032-22.752-39.584-39.296-65.6-39.296H224V384h10.656a32 32 0 1 0 0-64h-21.312C183.936 320 160 344.864 160 375.424v377.12c0 30.56 24 55.36 53.472 55.36h61.056a14.144 14.144 0 0 1 5.376 2.144l0.288 45.856a31.936 31.936 0 0 0 6.624 19.328c10.144 13.216 24.992 20.8 40.704 20.768h0.032c14.752 0 28.768-6.72 38.816-18.464l59.104-56.192c1.952-1.856 4.768-5.824 6.176-8.128a15.968 15.968 0 0 1 9.056-5.28h241.984a53.12 53.12 0 0 0 47.296-29.824 31.68 31.68 0 0 0 6.016-18.688v-6.88a32 32 0 0 0-32-32" p-id="2255" fill="#313131"></path>
										<path d="M832 551.936h-50.56c-16.032 0-32.224 6.752-45.44 16.896-3.04 2.336-6.24 4.448-8.896 7.168a68.736 68.736 0 0 0-11.264 15.232 32.256 32.256 0 0 0-3.68 14.72l-0.064 12.64-34.4-32.672c-2.4-3.616-5.536-6.752-8.64-9.92-14.048-14.4-34.176-24.064-53.76-24.064H384V192h448v359.936zM890.848 160c-8.544-18.848-26.848-32-48.192-32H373.344c-21.344 0-39.648 13.152-48.192 32a56.96 56.96 0 0 0-5.152 23.392v377.152c0 5.408 0.992 10.528 2.368 15.456 6.496 23.008 26.752 39.936 50.944 39.936h241.952a15.968 15.968 0 0 1 9.024 5.184 31.392 31.392 0 0 0 6.24 8.224l59.104 56.192c10.048 11.776 24.064 18.464 38.816 18.464h0.032c15.712 0 30.56-7.552 40.704-20.768a31.936 31.936 0 0 0 6.624-19.328l0.288-45.888a13.568 13.568 0 0 1 5.344-2.08h61.088c24.256 0 44.576-16.928 51.072-39.936 1.408-4.928 2.4-10.048 2.4-15.456V183.392A56.96 56.96 0 0 0 890.848 160z" p-id="2256" fill="#313131"></path>
										<path d="M528 320a48 48 0 1 0 0.032 96.032 48 48 0 0 0-0.032-96M688 320a48 48 0 1 0 0.032 96.032 48 48 0 0 0-0.032-96" p-id="2257" fill="#313131"></path>
									</svg>
		  					</div>
		  					<p>小区</p>
		  				</div>
	  				</router-link>	  				
	  			</li>
	  			
	  			<li>
	  				<router-link to='/index/city' active-class='color_green'>
		  				<div class="svg_word">
		  					<div class="svg">
		  						<svg viewBox="0 0 1024 1024" width="200" height="200">
										<path d="M512 813.312C445.568 732.928 288 520.064 288 416c0-123.488 100.48-224 224-224s224 100.512 224 224c0 103.776-156.96 316.064-224 397.344M512 128c-158.784 0-288 129.184-288 288 0 148.416 217.696 413.088 243.232 443.616a57.92 57.92 0 0 0 44.8 21.856h0.096a57.6 57.6 0 0 0 44.512-21.696C581.536 830.016 800 564.672 800 416c0-158.816-129.216-288-288-288" p-id="4017" fill="#313131"></path>
										<path d="M512 480c-35.296 0-64-28.704-64-64s28.704-64 64-64 64 28.704 64 64-28.704 64-64 64m0-192c-70.592 0-128 57.408-128 128s57.408 128 128 128 128-57.408 128-128-57.408-128-128-128" p-id="4018" fill="#313131"></path>
									</svg>
		  					</div>
		  					<p>城市</p>
		  				</div>
	  				</router-link>	  				
	  			</li>
	  			
	  			<li>
	  				<router-link to='/index/scan' active-class='color_green'>
		  				<div class="svg_word">
		  					<div class="svg" id="scan_id">
		  						<svg viewBox="0 0 1024 1024" style="background: #313131;padding: 0.2rem;border-radius: 50%;">
										<path d="M128 384V160c0-17.6 14.4-32 32-32h224v64H192v192h-64z m512-192h192v192h64V160c0-17.6-14.4-32-32-32H640v64z m192 448v192H640v64h224c17.6 0 32-14.4 32-32V640h-64z m-448 192H192V640h-64v224c0 17.6 14.4 32 32 32h224v-64z m512-352H128v64h768v-64z" fill="#ffffff"></path>
									</svg>
		  					</div>
		  					<p>扫一扫</p>
		  				</div>
	  				</router-link>	  				
	  			</li>
	  			
	  			<li>
	  				<router-link to='/index/life' active-class='color_green'>
		  				<div class="svg_word">
		  					<div class="svg">
		  						<svg viewBox="0 0 1024 1024" width="200" height="200">
										<path d="M224 832.192V320l576-0.224L800.256 832 224 832.192zM512 160c52.928 0 96 43.04 96 96h-192c0-52.96 43.072-96 96-96z m288.256 96H672c0-88.224-71.776-160-160-160s-160 71.776-160 160H223.744A63.84 63.84 0 0 0 160 319.776v512.416C160 867.392 188.608 896 223.744 896h576.512A63.872 63.872 0 0 0 864 832.192V319.776A63.84 63.84 0 0 0 800.256 256z" p-id="2255" fill="#313131"></path>
										<path d="M700.64 612.288a32 32 0 0 0-43.712 11.68A160.608 160.608 0 0 1 518.304 704a160.576 160.576 0 0 1-138.592-80 32 32 0 0 0-55.424 32.032 224.896 224.896 0 0 0 194.016 112 224.768 224.768 0 0 0 194.016-112 32 32 0 0 0-11.68-43.744" p-id="2256" fill="#313131"></path>
									</svg>
		  					</div>
		  					<p>生活</p>
		  				</div>
	  				</router-link>
	  			</li>
	  			
	  			<li>
	  				<router-link to='/index/mine' active-class='color_green'>
		  				<div class="svg_word">
		  					<div class="svg">
		  						<svg viewBox="0 0 1024 1024" width="200" height="200">
										<path d="M512 563.2c-127.9744 0-230.4-115.2512-230.4-256s102.4256-256 230.4-256 230.4 115.2512 230.4 256-102.4256 256-230.4 256z m0-51.2c98.2528 0 179.2-91.0592 179.2-204.8s-80.9472-204.8-179.2-204.8-179.2 91.0592-179.2 204.8 80.9472 204.8 179.2 204.8zM128 793.6a179.2 179.2 0 0 1 179.3792-179.2h409.2416C815.6416 614.4 896 694.7328 896 793.6a179.2 179.2 0 0 1-179.3792 179.2H307.3792C208.3584 972.8 128 892.4672 128 793.6z m51.2 0c0 70.5792 57.4464 128 128.1792 128h409.2416A128 128 0 0 0 844.8 793.6c0-70.5792-57.4464-128-128.1792-128H307.3792A128 128 0 0 0 179.2 793.6z" fill="#313131"></path>
									</svg>
		  					</div>
		  					<p>我的</p>
		  				</div>
	  				</router-link>	
	  			</li>
	  			
	  		</ul>
	  	</div>
  	</div>
  	
  </div>
</template>

<script type="es6">
export default {
  name: 'app',
	beforeCreate: function () {
		
  },
  methods:{
  	
  }
}
</script>

<style>

#app .zr_index .zr_bottom{
	position: fixed;
	bottom: 0;
}
#app .zr_index .zr_bottom{
	width: 100%;
	background: white;
}
#app .zr_index .zr_bottom ul{
	display: flex;
	width: 100%;
	padding-bottom: 0.15rem;
}
#app .zr_index .zr_bottom ul li{
	list-style: none;
	justify-content: space-between;
	flex: 1;
	margin-top: 0.1rem;
}
#app .zr_index .zr_bottom ul li a{
	text-decoration: none;
	color: #313131;
}
#app .zr_index .zr_bottom ul li:nth-child(3){
	margin-top: 0rem;
}

#app .zr_index .zr_bottom ul li:nth-child(3) .svg_word p{
	margin-top: 0.1rem;
}
#app .zr_index .zr_bottom ul li .svg_word{
	
}
#app .zr_index .zr_bottom ul li .svg_word .svg svg{
	width: 1.4rem;
	height: 1.4rem;
	padding: 0px;
	box-sizing: border-box;
	/*background: red;*/
}
#app .zr_index .zr_bottom ul li .svg_word p{
	font-size: 0.8rem;
}
#app .zr_index .zr_bottom ul li .color_green{
	color: #40b240;
}
</style>

